<a href="https://colab.research.google.com/github/ajay152603/Python-for-DS/blob/master/2.%20pandas%20-%20Data%20how%20you%20want%20it%20%23python-lib" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 2. pandas - Data how you want it #python-lib

1. Load the pandas package

In [54]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [0]:
#1. Load the pandas package
import pandas as pd

In [56]:
#% cd /content/sample_data
%ls

anscombe.json*                Customers.xlsx         README.md*
california_housing_test.csv   mnist_test.csv
california_housing_train.csv  mnist_train_small.csv

In [0]:
#2. I want to store customers data. For a number of customers I know, the name(characters), age(integers), and sex(male/female) data.
# df = pd.DataFrame ( {
#     "name": [ "Ajay", "Sanjay","Michael"],
#     "Age": [25,65,48],
#      "Gender": [ "M","M","F"]
    
# })
# df

Note that: A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers,floating point values, categorical data and more) in columns.

In [58]:
#3. To access the data of one column:
df['name']

0       Ajay
1     Sanjay
2    Michael
Name: name, dtype: object

In [59]:
#4. To know the maximum/min age of the customers:

#df['Age'].min()
df['Age'].max()

65

In [60]:
#5. If you are interested of some basic statistics of the numerical data of your table try describe() method, 
#    which provides a quick overview of the numerical data in a DataFrame

df.describe()

            Age
count   3.00000
mean   46.00000
std    20.07486
min    25.00000
25%    36.50000
50%    48.00000
75%    56.50000
max    65.00000

In [0]:
#6. Dealing with CSV files pandas provides the read_csv() function to read data stored as a csv file into a pandas DataFrame

CustomerData = pd.read_csv("/content/P6-UK-Bank-Customers.csv")

In [62]:
CustomerData

      Customer ID       Name  ... Date Joined    Balance
0       100000001      Simon  ...   05.Jan.15  113810.15
1       400000002    Jasmine  ...   06.Jan.15   36919.73
2       100000003       Liam  ...   07.Jan.15  101536.83
3       300000004     Trevor  ...   08.Jan.15    1421.52
4       100000005    Deirdre  ...   09.Jan.15   35639.79
...           ...        ...  ...         ...        ...
4009    200004010        Sam  ...   30.Dec.15   19711.66
4010    200004011      Keith  ...   30.Dec.15   56069.72
4011    200004012     Hannah  ...   30.Dec.15   59477.82
4012    200004013  Christian  ...   30.Dec.15     239.45
4013    300004014    Stephen  ...   30.Dec.15   30293.19

[4014 rows x 9 columns]

In [63]:
CustomerData.describe()

        Customer ID          Age        Balance
count  4.014000e+03  4014.000000    4014.000000
mean   1.696831e+08    38.611111   39766.448274
std    8.865374e+07     9.819121   29859.489192
min    1.000000e+08    15.000000      11.520000
25%    1.000020e+08    31.000000   16115.367500
50%    1.000038e+08    37.000000   33567.330000
75%    2.000031e+08    45.000000   57533.930000
max    4.000038e+08    64.000000  183467.700000

In [64]:
#To see the first two rows :
CustomerData.head()

   Customer ID     Name  Surname  ... Job Classification  Date Joined    Balance
0    100000001    Simon    Walsh  ...       White Collar    05.Jan.15  113810.15
1    400000002  Jasmine   Miller  ...        Blue Collar    06.Jan.15   36919.73
2    100000003     Liam    Brown  ...       White Collar    07.Jan.15  101536.83
3    300000004   Trevor     Parr  ...       White Collar    08.Jan.15    1421.52
4    100000005  Deirdre  Pullman  ...        Blue Collar    09.Jan.15   35639.79

[5 rows x 9 columns]

In [65]:
#A check on how pandas interpreted each of the column data
# types can be done by requesting the pandas dtypes attribute

CustomerData.dtypes

Customer ID             int64
Name                   object
Surname                object
Gender                 object
Age                     int64
Region                 object
Job Classification     object
Date Joined            object
Balance               float64
dtype: object

In [0]:
#To store the data in an excel file:

CustomerData.to_excel("Customers.xlsx",sheet_name= 'sheet1', index=False)

In [0]:
Customer =pd.read_excel("Customers.xlsx",sheet_name= 'sheet1')

In [68]:
Customer

      Customer ID       Name  ... Date Joined    Balance
0       100000001      Simon  ...   05.Jan.15  113810.15
1       400000002    Jasmine  ...   06.Jan.15   36919.73
2       100000003       Liam  ...   07.Jan.15  101536.83
3       300000004     Trevor  ...   08.Jan.15    1421.52
4       100000005    Deirdre  ...   09.Jan.15   35639.79
...           ...        ...  ...         ...        ...
4009    200004010        Sam  ...   30.Dec.15   19711.66
4010    200004011      Keith  ...   30.Dec.15   56069.72
4011    200004012     Hannah  ...   30.Dec.15   59477.82
4012    200004013  Christian  ...   30.Dec.15     239.45
4013    300004014    Stephen  ...   30.Dec.15   30293.19

[4014 rows x 9 columns]

In [70]:
#To get a technical summary of a DataFrame
Customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4014 entries, 0 to 4013
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         4014 non-null   int64
 1   Name                4014 non-null   object
 2   Surname             4014 non-null   object
 3   Gender              4014 non-null   object
 4   Age                 4014 non-null   int64
 5   Region              4014 non-null   object
 6   Job Classification  4014 non-null   object
 7   Date Joined         4014 non-null   object
 8   Balance             4014 non-null   float64
dtypes: float64(1), int64(2), object(6)
memory usage: 282.4+ KB

In [0]:
#Now let us select one column and look at its type and shape

sex=Customer['Gender']

In [79]:
sex.shape
sex.head(2)

0      Male
1    Female
Name: Gender, dtype: object

In [81]:
#To select multiple columns:

Customer[['Name', 'Gender']].head()

      Name  Gender
0    Simon    Male
1  Jasmine  Female
2     Liam    Male
3   Trevor    Male
4  Deirdre  Female

In [0]:
#To filter specific rows from a DataFrame: pass the customer who are elder than 29


CustomerAbove29= Customer[ Customer['Age']>29]

In [98]:
CustomerAbove29
#CustomerAbove29[ CustomerAbove29['Region']== "England"]

      Customer ID       Name  ... Date Joined    Balance
1       400000002    Jasmine  ...   06.Jan.15   36919.73
2       100000003       Liam  ...   07.Jan.15  101536.83
3       300000004     Trevor  ...   08.Jan.15    1421.52
4       100000005    Deirdre  ...   09.Jan.15   35639.79
5       300000006        Ava  ...   09.Jan.15  122443.77
...           ...        ...  ...         ...        ...
4009    200004010        Sam  ...   30.Dec.15   19711.66
4010    200004011      Keith  ...   30.Dec.15   56069.72
4011    200004012     Hannah  ...   30.Dec.15   59477.82
4012    200004013  Christian  ...   30.Dec.15     239.45
4013    300004014    Stephen  ...   30.Dec.15   30293.19

[3296 rows x 9 columns]

In [0]:
#How to select specific rows and columns from a DataFrame

Customerlocation=Customer.loc[Customer['Age']>29, 'Name']

In [105]:
Customerlocation.head()

1    Jasmine
2       Liam
3     Trevor
4    Deirdre
5        Ava
Name: Name, dtype: object

In [106]:
#Select rows from 1 to 3 and columns 1,2:
Customer.iloc[0:3,0:2]

   Customer ID     Name
0    100000001    Simon
1    400000002  Jasmine
2    100000003     Liam

In [0]:
Note:

Select specific rows and/or columns using loc when using the row and column names
Select specific rows and/or columns using iloc when using the positions in the table